---
title: ArgumentException
classe: Autodesk.Revit.Exceptions.ArgumentException
namespace: Autodesk.Revit.Exceptions
eredita: Autodesk.Revit.Exceptions.ApplicationException
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# ArgumentException

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Message { get; }` | `argumentException.Message` | String |
| `String ParamName { get; }` | `argumentException.ParamName` | String |
| `Void GetObjectData(SerializationInfo, StreamingContext)` | `argumentException.GetObjectData(info, context)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```